docs/srfi.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SRFI: wisp: simpler indentation-sensitive scheme</title>
<!-- 2014-12-21 So 20:59 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Arne Babenhauserheide" />
</head>
<body>
<div id="content">
<h1 class="title">SRFI: wisp: simpler indentation-sensitive scheme</h1>
<div class="abstract">
<p>
This SRFI describes a simple syntax which allows making scheme easier to read for newcomers while keeping the simplicity, generality and elegance of s-expressions. Similar to SRFI-110, SRFI-49 and Python it uses indentation to group expressions. Like SRFI-110 wisp is general and homoiconic. 
</p>

<p>
Different from its precedessors, wisp only uses the absolute minimum of additional syntax-elements which are required for writing and exchanging arbitrary code-structures. As syntax elements it only uses a colon surrounded by whitespace, the period followed by whitespace as first code-character on the line and optional underscores followed by whitespace at the beginning of the line.
</p>

<p>
It resolves a limitation of SRFI-110 and SRFI-49, both of which force the programmer to use a single argument per line if the arguments to a function need to be continued after a function-call.
</p>

<p>
Wisp expressions can include any s-expressions and as such provide backwards compatibility.
</p>

<table><tr><th>wisp</th><th>s-exp</th></tr><tr><td>
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">hello</span> who
<span style="color: #0000ff;">  format</span> <span style="color: #008b8b;">#t</span> <span style="color: #8b2252;">"~A ~A!\n"</span>
<span style="color: #a020f0;">          . </span><span style="color: #8b2252;">"Hello"</span> who
<span style="color: #0000ff;">hello</span>       <span style="color: #8b2252;">"Wisp"</span>
</pre>
</div>
</td><td>
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">hello</span> who)
  (format #t <span style="color: #8b2252;">"~A ~A!\n"</span>
             <span style="color: #8b2252;">"Hello"</span> who))
(hello       <span style="color: #8b2252;">"S-exp"</span>)
</pre>
</div>
</td></tr></table>

</div>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Authors</a>
<ul>
<li><a href="#sec-1-1">1.1. Acknowledgments</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Related SRFIs</a></li>
<li><a href="#sec-3">3. Rationale</a>
<ul>
<li><a href="#sec-3-1">3.1. Wisp example</a></li>
<li><a href="#sec-3-2">3.2. Advantages of Wisp</a></li>
<li><a href="#sec-3-3">3.3. Disadvantages of Wisp</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Specification</a>
<ul>
<li><a href="#sec-4-1">4.1. Overview</a></li>
<li><a href="#sec-4-2">4.2. More detailed: Wisp syntax rules</a></li>
<li><a href="#sec-4-3">4.3. Clarifications</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Syntax justification</a>
<ul>
<li><a href="#sec-5-1">5.1. . (the dot)</a></li>
<li><a href="#sec-5-2">5.2. : (the colon)</a></li>
<li><a href="#sec-5-3">5.3. _ (the underscore)</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Implementation</a>
<ul>
<li><a href="#sec-6-1">6.1. The generic wisp processor (code)</a></li>
<li><a href="#sec-6-2">6.2. Test Suite</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Copyright</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Authors</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Arne Babenhauserheide
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Acknowledgments</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Thanks for many constructive discussions goes to Alan Manuel K. Gloria and David A. Wheeler.
</li>
<li>Also thanks to Mark Weaver for his help with the wisp parser and the guile integration - including a 20x speedup.
</li>
</ul>
</div>
</div>
</div>
