docs/srfi.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Related SRFIs</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>SRFI-49 (Indentation-sensitive syntax): superceded by this SRFI, 
</li>
<li>SRFI-110 (Sweet-expressions (t-expressions)): alternative to this SRFI,
</li>
<li>SRFI-105 (neoteric expressions and curly infix): supported in this SRFI by treating curly braces like brackets and parentheses. Curly infix is required by the implementation and the testsuite.
</li>
<li>SRFI-30 (Nested Multi-line comments): complex interaction. Should be avoided at the beginning of lines, because it can make the indentation hard to distinguish for humans. SRFI-110 includes them, so there might be value in adding them. The wisp reference implementation does not treat them specially, though, which might create arbitrary complications.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Rationale</h2>
<div class="outline-text-2" id="text-3">
<p>
A big strength of Scheme and other lisp-like languages is their minimalistic syntax. By using only the most common characters like the period, the comma, the quote and quasiquote, the hash, the semicolon and the parens for the syntax (<code>.,"'`#;()</code>), they are very close to natural language<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>. Along with the minimal list-structure of the code, this gives these languages a timeless elegance.
</p>

<p>
But as SRFI-110 explains very thoroughly (which we need not repeat here), the parentheses at the beginning of lines hurt readability and scare away newcomers. Additionally using indentation to mark the structure of the code follows naturally from the observation that most programmers use indentation, with many programmers letting their editor indent code automatically to fit the structure. Indentation is an important way how programmers understand code and using it directly to define the structure avoids errors due to mismatches between indentation and actual meaning.
</p>

<p>
As a solution to this, SRFI-49 and SRFI-110 provide a way to write whitespace sensitive scheme, but both have their share of issues.
</p>

<p>
As noted in SRFI-110, there are a number of implementation-problems in SRFI-49, as well as specification shortcomings like choosing the name “group” for the construct which is necessary to represent double parentheses. In addition to the problems named in SRFI-110, SRFI-49 is not able to continue the arguments to a function on one line, if a prior argument was a function call. The example code in the abstract would have to be written in SRFI-49 as follows:
</p>

<div class="org-src-container">

<pre class="src src-scheme">* 5
  + 4 3
  2
  1
</pre>
</div>

<p>
SRFI-110 improves a lot over the implementation of SRFI-49. It resolves the group-naming and reduces the need to continue the argument-list by introducing 3 different grouping syntaxes (<code>$</code>, <code>\\</code> and <code>&lt;* *&gt;</code>). These additional syntax-elements however hurt readability for newcomers (obviously the authors of SRFI-110 disagree with this assertion. Their view is discussed in SRFI-110 in the section about wisp). The additional syntax elements lead to structures like the following (taken from examples from the readable project):
</p>
<div class="org-src-container">

<pre class="src src-scheme">myfunction 
  x: \\ original-x
  y: \\ calculate-y original-y
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme">a b $ c d e $ f g
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme">let &lt;* x getx() \\ y gety() *&gt;
! {{x * x} + {y * y}}
</pre>
</div>

<p>
This is not only hard to read, but also makes it harder to work with the code, because the programmer has to learn these additional syntax elements and keep them in mind before being able to understand the code.
</p>

<p>
Like SRFI-49 SRFI-110 also cannot continue the argument-list without resorting to single-element lines, though it reduces this problem by the above grouping syntaxes and advertising the use of neoteric expressions from SRFI-105.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Wisp example</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Since an example speaks more than a hundred explanations, the following shows wisp exploiting all its features - including curly-infix from SRFI-105:
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">factorial</span> n
<span style="color: #0000ff;">__</span>  <span style="color: #483d8b;">if</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">zero?</span> n
<span style="color: #0000ff;">____</span><span style="color: #a020f0;">   . </span><span style="color: #008b8b;">1</span>
<span style="color: #0000ff;">____   *</span> n<span style="color: #a020f0;"> : </span><span style="color: #0000ff;">factorial</span> {n - 1}

<span style="color: #0000ff;">display</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">factorial</span> <span style="color: #008b8b;">5</span> 
<span style="color: #0000ff;">newline</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Advantages of Wisp</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Wisp draws on the strength of SRFI-110 but avoids its complexities. It was conceived and improved in the discussions within the readable-project which preceded SRFI-110 and there is a comparison between readable in wisp in SRFI-110.
</p>

<p>
Like SRFI-110, wisp is general and homoiconic and interacts nicely with SRFI-105 (neoteric expressions and curly infix). Like SRFI-110, the expressions are the same in the REPL and in code-files. Like SRFI-110, wisp has been used for implementing multiple smaller programs, though the biggest program in wisp is still its implementations (written in wisp and bootstrapped via a simpler wisp preprocessor).
</p>

<p>
But unlike SRFI-110, wisp only uses the minimum of additional syntax-elements which are necessary to support arbitrary code-structures with indentation-sensitive code which is intended to be shared over the internet. To realize these syntax-elements, it generalizes existing syntax and draws on the most common non-letter non-math characters in prose. This allows keeping the actual representation of the code elegant and inviting to newcomers.
</p>

<p>
Wisp expressions are not as sweet as <a href="http://readable.sf.net">readable</a>, but they KISS.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Disadvantages of Wisp</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Using the colon as syntax element keeps the code very close to written prose, but it can interfere with type definitions as for example used in Typed Racket<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>. This can be mitigated in let- and lambda-forms by using the parenthesized form. When doing so, wisp avoids the double-paren for type-declarations and as such makes them easier to catch by eye. For function definitions (the only <code>define</code> call where type declarations are needed in typed-racket<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>), a <code>declare</code> macro directly before the <code>define</code> should work well.
</p>

<p>
Using the period to continue the argument list is unusual compared to other languages and as such can lead to errors when trying to return a variable from a procedure and forgetting the period.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Specification</h2>
<div class="outline-text-2" id="text-4">
<p>
The specification is separated into four parts: A general overview of the syntax, a more detailed description, justifications for each added syntax element and clarifications for technical details.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Overview</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The basics of wisp syntax can be defined in 4 rules, each of which emerges directly from a requirement:
</p>
</div>

<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Wisp syntax 1/4: function calls</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Indentation:
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #0000ff;">display</span> 
<span style="color: #0000ff;">  +</span> <span style="color: #008b8b;">3</span> <span style="color: #008b8b;">4</span> <span style="color: #008b8b;">5</span>
<span style="color: #0000ff;">newline</span>
</pre>
</div>

<p>
becomes
</p>

<div class="org-src-container">

<pre class="src src-scheme">(display 
  (+ 3 4 5))
(newline)
</pre>
</div>

<p>
<i>requirement: call functions without parenthesis.</i>
</p>
</div>
</div>
