docs/srfi.org
*** Wisp syntax 2/4: Continue Argument list

The period:

#+BEGIN_SRC wisp
+ 5
  * 4 3
  . 2 1
#+END_SRC

becomes

#+BEGIN_SRC scheme
(+ 5
  (* 4 3)
  2 1)
#+END_SRC

This also works with just one argument after the period. To start a line without a function call, you have to prefix it with a period followed by whitespace.[fn:2]

/requirement: continue the argument list of a function after an intermediate call to another function./

*** Wisp syntax 3/4: Double Parens

The colon:[fn:3]

#+BEGIN_SRC wisp
let 
  : x 1
    y 2
    z 3
  body
#+END_SRC

becomes

#+BEGIN_SRC scheme
(let
  ((x 1)
   (y 2)
   (z 3))
  (body))
#+END_SRC

/requirement: represent code with two adjadent blocks in double-parentheses./

*** Wisp syntax 4/4: Resilient Indentation

The underscore (optional):

#+BEGIN_SRC wisp
let 
_ : x 1
__  y 2
__  z 3
_ body
#+END_SRC

becomes

#+BEGIN_SRC scheme
(let
  ((x 1)
   (y 2)
   (z 3))
  (body))
#+END_SRC
 
/requirement: share code in environments which do not preserve whitespace./

*** Summary

The syntax shown here is the minimal syntax required for the goal of wisp: indentation-based, general lisp with a simple preprocessor, and code which can be shared easily on the internet:

- =.= to continue the argument list
- =:= for double parens
- =_= to survive HTML

** More detailed: Wisp syntax rules
   
*** Unindented line

*A line without indentation is a function call*, just as if it would start with a parenthesis.

#+BEGIN_SRC wisp
    display "Hello World!"      ;      (display "Hello World!")
#+END_SRC
     
*** Sibling line
*A line which is more indented than the previous line is a sibling to that line*: It opens a new parenthesis.

#+BEGIN_SRC wisp
    display                              ;    (display
      string-append "Hello " "World!"    ;      (string-append "Hello " "World!"))
#+END_SRC
     
*** Closing line
*A line which is not more indented than previous line(s) closes the parentheses of all previous lines which have higher or equal indentation*. You should only reduce the indentation to indentation levels which were already used by parent lines, else the behaviour is undefined.

#+BEGIN_SRC wisp
    display                              ;    (display
      string-append "Hello " "World!"    ;      (string-append "Hello " "World!"))
    display "Hello Again!"               ;    (display "Hello Again!")
#+END_SRC

*** Prefixed line

*To add any of ' , ` #' #, #` or #@, to the first parenthesis on a line, just prefix the line with that symbol* followed by at least one space. Implementations are free to add more prefix symbols.

#+BEGIN_SRC wisp
    ' "Hello World!"      ;      '("Hello World!")
#+END_SRC


*** Continuing line
*A line whose first non-whitespace characters is a dot followed by a space (". ") does not open a new parenthesis: it is treated as simple continuation of the first less indented previous line*. In the first line this means that this line does not start with a parenthesis and does not end with a parenthesis, just as if you had directly written it in lisp without the leading ". ".

#+BEGIN_SRC wisp
    string-append "Hello"        ;    (string-append "Hello"
      string-append " " "World"  ;      (string-append " " "World")
      . "!"                      ;      "!")
#+END_SRC


*** Empty indentation level
*A line which contains only whitespace and a colon (":") defines an indentation level at the indentation of the colon*. It opens a parenthesis which gets closed by the next line which has less or equal indentation. If you need to use a colon by itself. you can escape it as "\:".

#+BEGIN_SRC wisp
    let                       ;    (let
      :                       ;      (
        msg "Hello World!"    ;        (msg "Hello World!"))
      display msg             ;      (display msg))
#+END_SRC


