docs/srfi.html

<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Wisp syntax 2/4: Continue Argument list</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
The period:
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #0000ff;">+</span> <span style="color: #008b8b;">5</span>
<span style="color: #0000ff;">  *</span> <span style="color: #008b8b;">4</span> <span style="color: #008b8b;">3</span>
<span style="color: #a020f0;">  . </span><span style="color: #008b8b;">2</span> <span style="color: #008b8b;">1</span>
</pre>
</div>

<p>
becomes
</p>

<div class="org-src-container">

<pre class="src src-scheme">(+ 5
  (* 4 3)
  2 1)
</pre>
</div>

<p>
This also works with just one argument after the period. To start a line without a function call, you have to prefix it with a period followed by whitespace.<sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup>
</p>

<p>
<i>requirement: continue the argument list of a function after an intermediate call to another function.</i>
</p>
</div>
</div>

<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> Wisp syntax 3/4: Double Parens</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
The colon:<sup><a id="fnr.5" name="fnr.5" class="footref" href="#fn.5">5</a></sup>
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">let</span> 
<span style="color: #a020f0;">  : </span><span style="color: #0000ff;">x</span> <span style="color: #008b8b;">1</span>
<span style="color: #0000ff;">    y</span> <span style="color: #008b8b;">2</span>
<span style="color: #0000ff;">    z</span> <span style="color: #008b8b;">3</span>
<span style="color: #0000ff;">  body</span>
</pre>
</div>

<p>
becomes
</p>

<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #a020f0;">let</span>
  ((x 1)
   (y 2)
   (z 3))
  (body))
</pre>
</div>

<p>
<i>requirement: represent code with two adjadent blocks in double-parentheses.</i>
</p>
</div>
</div>

<div id="outline-container-sec-4-1-4" class="outline-4">
<h4 id="sec-4-1-4"><span class="section-number-4">4.1.4</span> Wisp syntax 4/4: Resilient Indentation</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
The underscore (optional):
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">let</span> 
<span style="color: #a020f0;">_ : </span><span style="color: #0000ff;">x</span> <span style="color: #008b8b;">1</span>
<span style="color: #0000ff;">__  y</span> <span style="color: #008b8b;">2</span>
<span style="color: #0000ff;">__  z</span> <span style="color: #008b8b;">3</span>
<span style="color: #0000ff;">_ body</span>
</pre>
</div>

<p>
becomes
</p>

<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #a020f0;">let</span>
  ((x 1)
   (y 2)
   (z 3))
  (body))
</pre>
</div>

<p>
<i>requirement: share code in environments which do not preserve whitespace.</i>
</p>
</div>
</div>

<div id="outline-container-sec-4-1-5" class="outline-4">
<h4 id="sec-4-1-5"><span class="section-number-4">4.1.5</span> Summary</h4>
<div class="outline-text-4" id="text-4-1-5">
<p>
The syntax shown here is the minimal syntax required for the goal of wisp: indentation-based, general lisp with a simple preprocessor, and code which can be shared easily on the internet:
</p>

<ul class="org-ul">
<li><code>.</code> to continue the argument list
</li>
<li><code>:</code> for double parens
</li>
<li><code>_</code> to survive HTML
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> More detailed: Wisp syntax rules</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Unindented line</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
<b>A line without indentation is a function call</b>, just as if it would start with a parenthesis.
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #0000ff;">display</span> <span style="color: #8b2252;">"Hello World!"</span>      <span style="color: #b22222;">;      </span><span style="color: #b22222;">(display "Hello World!")</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Sibling line</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
<b>A line which is more indented than the previous line is a sibling to that line</b>: It opens a new parenthesis.
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #0000ff;">display</span>                              <span style="color: #b22222;">;    </span><span style="color: #b22222;">(display</span>
<span style="color: #0000ff;">  string-append</span> <span style="color: #8b2252;">"Hello "</span> <span style="color: #8b2252;">"World!"</span>    <span style="color: #b22222;">;      </span><span style="color: #b22222;">(string-append "Hello " "World!"))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> Closing line</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
<b>A line which is not more indented than previous line(s) closes the parentheses of all previous lines which have higher or equal indentation</b>. You should only reduce the indentation to indentation levels which were already used by parent lines, else the behaviour is undefined.
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #0000ff;">display</span>                              <span style="color: #b22222;">;    </span><span style="color: #b22222;">(display</span>
<span style="color: #0000ff;">  string-append</span> <span style="color: #8b2252;">"Hello "</span> <span style="color: #8b2252;">"World!"</span>    <span style="color: #b22222;">;      </span><span style="color: #b22222;">(string-append "Hello " "World!"))</span>
<span style="color: #0000ff;">display</span> <span style="color: #8b2252;">"Hello Again!"</span>               <span style="color: #b22222;">;    </span><span style="color: #b22222;">(display "Hello Again!")</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2-4" class="outline-4">
<h4 id="sec-4-2-4"><span class="section-number-4">4.2.4</span> Prefixed line</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
<b>To add any of ' , ` #' #, #` or #@, to the first parenthesis on a line, just prefix the line with that symbol</b> followed by at least one space. Implementations are free to add more prefix symbols.
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #0000ff;">'</span> <span style="color: #8b2252;">"Hello World!"</span>      <span style="color: #b22222;">;      </span><span style="color: #b22222;">'("Hello World!")</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-4-2-5" class="outline-4">
<h4 id="sec-4-2-5"><span class="section-number-4">4.2.5</span> Continuing line</h4>
<div class="outline-text-4" id="text-4-2-5">
<p>
<b>A line whose first non-whitespace characters is a dot followed by a space (". ") does not open a new parenthesis: it is treated as simple continuation of the first less indented previous line</b>. In the first line this means that this line does not start with a parenthesis and does not end with a parenthesis, just as if you had directly written it in lisp without the leading ". ".
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #0000ff;">string-append</span> <span style="color: #8b2252;">"Hello"</span>        <span style="color: #b22222;">;    </span><span style="color: #b22222;">(string-append "Hello"</span>
<span style="color: #0000ff;">  string-append</span> <span style="color: #8b2252;">" "</span> <span style="color: #8b2252;">"World"</span>  <span style="color: #b22222;">;      </span><span style="color: #b22222;">(string-append " " "World")</span>
<span style="color: #a020f0;">  . </span><span style="color: #8b2252;">"!"</span>                      <span style="color: #b22222;">;      </span><span style="color: #b22222;">"!")</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-4-2-6" class="outline-4">
<h4 id="sec-4-2-6"><span class="section-number-4">4.2.6</span> Empty indentation level</h4>
<div class="outline-text-4" id="text-4-2-6">
<p>
<b>A line which contains only whitespace and a colon (":") defines an indentation level at the indentation of the colon</b>. It opens a parenthesis which gets closed by the next line which has less or equal indentation. If you need to use a colon by itself. you can escape it as "\:".
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">let</span>                       <span style="color: #b22222;">;    </span><span style="color: #b22222;">(let</span>
<span style="color: #a020f0;">  : </span>                      <span style="color: #b22222;">;      </span><span style="color: #b22222;">(</span>
<span style="color: #0000ff;">    msg</span> <span style="color: #8b2252;">"Hello World!"</span>    <span style="color: #b22222;">;        </span><span style="color: #b22222;">(msg "Hello World!"))</span>
<span style="color: #0000ff;">  display</span> msg             <span style="color: #b22222;">;      </span><span style="color: #b22222;">(display msg))</span>
</pre>
</div>
</div>
</div>
