docs/srfi.org
*** Inline Colon
*A colon sourrounded by whitespace (" : ") starts a parenthesis which gets closed at the end of the line*.

#+BEGIN_SRC wisp
    define : hello who                    ;    (define (hello who)
      display                             ;      (display 
        string-append "Hello " who "!"    ;        (string-append "Hello " who "!")))
#+END_SRC

If the colon starts a line which also contains other non-whitespace characters, it starts a parenthesis which gets closed at the end of the line *and* defines an indentation level at the position of the colon.

If the colon is the last non-whitespace character on a line, it represents an empty pair of parentheses:

#+BEGIN_SRC wisp
    let :                 ;    (let ()
        display "Hello"   ;         (display "Hello"))
#+END_SRC
     
*** Initial Underscores
*You can replace any number of consecutive initial spaces by underscores*, as long as at least one whitespace is left between the underscores and any following character. You can escape initial underscores by prefixing the first one with \ ("\___ a" → "(___ a)"), if you have to use them as function names.

#+BEGIN_SRC wisp
    define : hello who                    ;    (define (hello who)
    _ display                             ;      (display 
    ___ string-append "Hello " who "!"    ;        (string-append "Hello " who "!")))
#+END_SRC

*** Parens and Strings
*Linebreaks inside parentheses and strings are not considered linebreaks* for parsing indentation. To use parentheses at the beginning of a line without getting double parens, prefix the line with a period.

#+BEGIN_SRC wisp
define : stringy s 
         string-append s "can be varied as follows:
 "
           string-capitalize s
           string-reverse s
           . (string-capitalize
             (string-reverse s))
           . "
"

#+END_SRC

** Clarifications

- Code-blocks end after 2 empty lines followed by a newline. Indented non-empty lines after 2 empty lines should be treated as error. A line is empty if it only contains whitespace. A line with a comment is never empty.

- Inside parentheses, wisp parsing is disabled. Consequently linebreaks inside parentheses are not considered linebreaks for wisp-parsing. For the parser everything which happens inside parentheses is treated as a black box.

- Square brackets and curly braces should be treated the same way as parentheses: They stop the indentation processing until they are closed.

- Likewise linebreaks inside strings are not considered linebreaks for wisp-parsing.

- A colon (:) at the beginning of a line adds an extra open parentheses that gets closed at end-of-line (rule 4.2.7) *and* defines an indentation level.

- using a quote to escape a symbol separated from it by whitespace is forbidden. This would make the meaning of quoted lines ambigous.

- Curly braces should be treated as curly-infix following SRFI-105. This makes most math look natural to newcomers.

- Neoteric expressions from SRFI-105 are not required because they create multiple ways to represent the same code. In wisp they add much less advantages than in sweet expressions from SRFI-110, because wisp can continue the arguments to a function after a function call (with the leading period) and the inline colon provides most of the benefits neoteric expressions give to sweet. However implementations providing wisp should give users the option to activate neoteric expressions as by SRFI-105 to allow experimentation and evolution ([[http://sourceforge.net/p/readable/mailman/message/33068104/][discussion]]).

- It is possible to write code which is at the same time valid wisp and sweet. The readable mailinglist [[http://sourceforge.net/p/readable/mailman/message/33058992/][contains details]].

* Syntax justification

/I do not like adding any unnecessary syntax element to lisp. So I want to show explicitely why the syntax elements are required./

#+html: <small>
See also http://draketo.de/light/english/wisp-lisp-indentation-preprocessor#sec-4
#+html: </small>


** . (the dot)

To represent general code trees, we have to be able to represent continuation of the arguments of a function with an intermediate call to another (or the same) function.

The dot at the beginning of the line as marker of the continuation of a variable list is a generalization of using the dot as identity function - which is an implementation detail in many lisps.

#+BEGIN_QUOTE
=(. a)= is just =a=
#+END_QUOTE

So for the single variable case, this would not even need additional parsing: wisp could just parse =. a= to =(. a)= and produce the correct result in most lisps. But forcing programmers to always use separate lines for each parameter would be very inconvenient, so the definition of the dot at the beginning of the line is extended to mean “take every element in this line as parameter to the parent function”. 

#+BEGIN_QUOTE
=(. a)= → =a= is generalized to =(. a b c)= → =a b c=.
#+END_QUOTE

At its core, this dot-rule means that we mark variables in the code instead of function calls. We do so, because variables at the beginning of a line are much rarer in Scheme than in other programming languages.

