docs/srfi.html


<div id="outline-container-sec-4-2-7" class="outline-4">
<h4 id="sec-4-2-7"><span class="section-number-4">4.2.7</span> Inline Colon</h4>
<div class="outline-text-4" id="text-4-2-7">
<p>
<b>A colon sourrounded by whitespace (" : ") starts a parenthesis which gets closed at the end of the line</b>.
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">hello</span> who                    <span style="color: #b22222;">;    </span><span style="color: #b22222;">(define (hello who)</span>
<span style="color: #0000ff;">  display</span>                             <span style="color: #b22222;">;      </span><span style="color: #b22222;">(display </span>
<span style="color: #0000ff;">    string-append</span> <span style="color: #8b2252;">"Hello "</span> who <span style="color: #8b2252;">"!"</span>    <span style="color: #b22222;">;        </span><span style="color: #b22222;">(string-append "Hello " who "!")))</span>
</pre>
</div>

<p>
If the colon starts a line which also contains other non-whitespace characters, it starts a parenthesis which gets closed at the end of the line <b>and</b> defines an indentation level at the position of the colon.
</p>

<p>
If the colon is the last non-whitespace character on a line, it represents an empty pair of parentheses:
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">let</span><span style="color: #a020f0;"> : </span>                <span style="color: #b22222;">;    </span><span style="color: #b22222;">(let ()</span>
<span style="color: #0000ff;">    display</span> <span style="color: #8b2252;">"Hello"</span>   <span style="color: #b22222;">;         </span><span style="color: #b22222;">(display "Hello"))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2-8" class="outline-4">
<h4 id="sec-4-2-8"><span class="section-number-4">4.2.8</span> Initial Underscores</h4>
<div class="outline-text-4" id="text-4-2-8">
<p>
<b>You can replace any number of consecutive initial spaces by underscores</b>, as long as at least one whitespace is left between the underscores and any following character. You can escape initial underscores by prefixing the first one with \ ("\___ a" → "(<span class="underline">_</span> a)"), if you have to use them as function names.
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">hello</span> who                    <span style="color: #b22222;">;    </span><span style="color: #b22222;">(define (hello who)</span>
<span style="color: #0000ff;">_ display</span>                             <span style="color: #b22222;">;      </span><span style="color: #b22222;">(display </span>
<span style="color: #0000ff;">___ string-append</span> <span style="color: #8b2252;">"Hello "</span> who <span style="color: #8b2252;">"!"</span>    <span style="color: #b22222;">;        </span><span style="color: #b22222;">(string-append "Hello " who "!")))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2-9" class="outline-4">
<h4 id="sec-4-2-9"><span class="section-number-4">4.2.9</span> Parens and Strings</h4>
<div class="outline-text-4" id="text-4-2-9">
<p>
<b>Linebreaks inside parentheses and strings are not considered linebreaks</b> for parsing indentation. To use parentheses at the beginning of a line without getting double parens, prefix the line with a period.
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">stringy</span> s 
<span style="color: #0000ff;">         string-append</span> s <span style="color: #8b2252;">"can be varied as follows:</span>
<span style="color: #8b2252;"> "</span> <span style="color: #b22222;">; </span><span style="color: #b22222;">linebreak in string does not affect wisp parsing</span>
<span style="color: #0000ff;">           string-capitalize</span> s
<span style="color: #0000ff;">           string-reverse</span> s
<span style="color: #a020f0;">           . </span>(<span style="color: #0000ff;">string-capitalize</span> <span style="color: #b22222;">; </span><span style="color: #b22222;">linebreaks in parentheses are ignored.</span>
<span style="color: #0000ff;">             (string-reverse</span> s))
<span style="color: #a020f0;">           . </span><span style="color: #8b2252;">"</span>
<span style="color: #8b2252;">"</span>
</pre>
</div>

<p>
Effectively code in parentheses and strings is interpreted directly as Scheme. This way you can simply copy a thunk of scheme into wisp. The following is valid wisp:
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">define</span> foo (<span style="color: #0000ff;">+</span> <span style="color: #008b8b;">1</span>
<span style="color: #0000ff;">  (*</span> <span style="color: #008b8b;">2</span> <span style="color: #008b8b;">3</span>)) <span style="color: #b22222;">; </span><span style="color: #b22222;">defines foo as 7</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Clarifications</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Code-blocks end after 2 empty lines followed by a newline. Indented non-empty lines after 2 empty lines should be treated as error. A line is empty if it only contains whitespace. A line with a comment is never empty.
</li>

<li>Inside parentheses, wisp parsing is disabled. Consequently linebreaks inside parentheses are not considered linebreaks for wisp-parsing. For the parser everything which happens inside parentheses is treated as a black box.
</li>

<li>Square brackets and curly braces should be treated the same way as parentheses: They stop the indentation processing until they are closed.
</li>

<li>Likewise linebreaks inside strings are not considered linebreaks for wisp-parsing.
</li>

<li>A colon (:) at the beginning of a line adds an extra open parentheses that gets closed at end-of-line (rule 4.2.7) <b>and</b> defines an indentation level.
</li>

<li>using a quote to escape a symbol separated from it by whitespace is forbidden. This would make the meaning of quoted lines ambigous.
</li>

<li>Curly braces should be treated as curly-infix following SRFI-105. This makes most math look natural to newcomers.
</li>

<li>Neoteric expressions from SRFI-105 are not required because they create multiple ways to represent the same code. In wisp they add much less advantages than in sweet expressions from SRFI-110, because wisp can continue the arguments to a function after a function call (with the leading period) and the inline colon provides most of the benefits neoteric expressions give to sweet. However implementations providing wisp should give users the option to activate neoteric expressions as by SRFI-105 to allow experimentation and evolution (<a href="http://sourceforge.net/p/readable/mailman/message/33068104/">discussion</a>).
</li>

<li>It is possible to write code which is at the same time valid wisp and sweet. The readable mailinglist <a href="http://sourceforge.net/p/readable/mailman/message/33058992/">contains details</a>.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Syntax justification</h2>
<div class="outline-text-2" id="text-5">
<p>
<i>I do not like adding any unnecessary syntax element to lisp. So I want to show explicitely why the syntax elements are required.</i>
</p>

<small>
<p>
See also <a href="http://draketo.de/light/english/wisp-lisp-indentation-preprocessor#sec-4">http://draketo.de/light/english/wisp-lisp-indentation-preprocessor#sec-4</a>
</p>
</small>
</div>


<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> . (the dot)</h3>
<div class="outline-text-3" id="text-5-1">
<p>
To represent general code trees, we have to be able to represent continuation of the arguments of a function with an intermediate call to another (or the same) function.
</p>

<p>
The dot at the beginning of the line as marker of the continuation of a variable list is a generalization of using the dot as identity function - which is an implementation detail in many lisps.
</p>

<blockquote>
<p>
<code>(. a)</code> is just <code>a</code>
</p>
</blockquote>

<p>
So for the single variable case, this would not even need additional parsing: wisp could just parse <code>. a</code> to <code>(. a)</code> and produce the correct result in most lisps. But forcing programmers to always use separate lines for each parameter would be very inconvenient, so the definition of the dot at the beginning of the line is extended to mean “take every element in this line as parameter to the parent function”. 
</p>

<blockquote>
<p>
<code>(. a)</code> → <code>a</code> is generalized to <code>(. a b c)</code> → <code>a b c</code>.
</p>
</blockquote>

<p>
At its core, this dot-rule means that we mark variables in the code instead of function calls. We do so, because variables at the beginning of a line are much rarer in Scheme than in other programming languages.
</p>
</div>
</div>
