docs/srfi.org
** : (the colon)

For double parentheses and for some other cases we must have a way to mark indentation levels which do not contain code. Wisp uses the colon, because it is the most common non-alpha-numeric character in normal prose which is not already reserved as syntax by Scheme when it is surrounded by whitespace, and because it already gets used without sourrounding whitespace for marking keyword arguments to functions in Emacs Lisp and Common Lisp, so it does not add completely alien concepts.

The inline function call via inline " : " is a limited generalization of using the colon to mark an indentation level: If we add a syntax-element, we should use it as widely as possible to justify adding syntax overhead.

But if you need to use =:= as variable or function name, you can still do so by escaping it with a backslash (=\:=), so this does not forbid using the character.

For simple cases, the colon could be replaced by clever whitespace parsing, but there are complex cases which make this impossible. The minimal example is a theoretical doublelet which does not require a body:[fn:4]

#+BEGIN_SRC scheme
(doublelet
  ((foo bar))
  ((bla foo)))
#+END_SRC

The wisp version of this is

#+BEGIN_SRC wisp
doublelet
  :
    foo bar
  : ; <- this empty backstep is the real issue
    bla foo
#+END_SRC

or shorter with inline colon (which you can use only if you don’t need further indentation-syntax inside the assignment).

#+BEGIN_SRC wisp
doublelet
  : foo bar
  : bla foo
#+END_SRC

The need to be able to represent arbitrary syntax trees which can contain expressions like this is the real reason, why the colon exists. The inline and start-of-line use is only a generalization of that principle (we add a syntax-element, so we should see how far we can push it to reduce the effective cost of introducing the additional syntax).

*** Clever whitespace-parsing which would not work

There are two alternative ways to tackle this issue: deferred level-definition and fixed-width indentation.

Defining intermediate indentation-levels by later elements (deferred definition) would be a problem, because it would create code which is really hard to understand. An example is the following:

#+BEGIN_SRC wisp
define (flubb)
    nubb
    hubb
    subb
   gam
#+END_SRC

would become

#+BEGIN_SRC scheme
(define (flubb)
   ((nubb))
   ((hubb))
   ((subb))
  (gam))
#+END_SRC

while

#+BEGIN_SRC wisp
define (flubb)
    nubb
    hubb
    subb
#+END_SRC

would become

#+BEGIN_SRC scheme
(define (flubb)
   (nubb)
   (hubb)
   (subb))
#+END_SRC

Knowledge of later parts of the code would be necessary to understand the parts a programmer is working on at the moment. This would call for subtle errors which would be hard to track down, because the effect of a change in code would not be localized at the point where the change is done but could propagate backwards.

Fixed indentation width (alternative option to inferring it from later lines) would make it really hard to write readable code. Stuff like this would not be possible:

#+BEGIN_SRC wisp
when
    equal? wrong
           isright? stuff
    fixstuff﻿
#+END_SRC

** _ (the underscore)

In Python the whitespace hostile html already presents problems with sharing code - for example in email list archives and forums. But Python-programmers can mostly infer the indentation by looking at the previous line: If that ends with a colon, the next line must be more indented (there is nothing to clearly mark reduced indentation, though). In wisp we do not have this support, so we need a way to survive in the hostile environment of todays web.

The underscore is commonly used to denote a space in URLs, where spaces are inconvenient, but it is rarely used in Scheme (where the dash ("-") is mostly used instead), so it seems like a a natural choice.

You can still use underscores anywhere but at the beginning of the line, and even at the beginning of the line you simply need to escape it by prefixing the first underscore with a backslash ("\____").

* Implementation

This reference implementation realizes a specialized parser for Scheme. It uses GNU Guile and can also be used at the REPL. 

The wisp code also contains a general wisp-preprocessor which can be used for any lisp-like language and can used as an external program which gets called on reading. It does not actually have to understand the code itself. This is not part of this SRFI, though.

To allow for easy re-implementation, the chapter after the implementation itself contains a test-suite with commonly used wisp constructs and parenthesized counterparts.

The wisp preprocessor implementation can be found at http://draketo.de/proj/wisp. Both implementations are explicitly licensed to allow inclusion in an SRFI.

** The generic wisp processor (code)

TODO: Include the code from http://draketo.de/proj/wisp

** Test Suite

The wisp test-suite consists of a large number of wisp-snippets and the corresponding scheme-code. 

A wisp-implementation may call itself compliant with the wisp test-suite if the code tree parsed from the wisp file is the same as a code tree parsed from the equivalent Scheme file.

A wisp-implementation may call itself a compliant wisp pre-processor if it successfully converts each wisp-snippet into the corresponging scheme-snippet. Blank lines at the end of the file and non-functional white-space in the produced scheme-file do not matter for this purpose.

This test-suite is also available in the [[http://draketo.de/proj/wisp][wisp repository]] along with a script-runner (runtests.sh) which tests the reference wisp-implementation with GNU Guile against this testsuite.[fn:5]

*** tests/syntax-underscore.w
#+begin_src wisp
define : a b c
_ d e
___ f
___ g h
__  . i

define : _
_  display "hello\n"

\_
#+end_src 
