docs/srfi.html

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> : (the colon)</h3>
<div class="outline-text-3" id="text-5-2">
<p>
For double parentheses and for some other cases we must have a way to mark indentation levels which do not contain code. Wisp uses the colon, because it is the most common non-alpha-numeric character in normal prose which is not already reserved as syntax by Scheme when it is surrounded by whitespace, and because it already gets used without sourrounding whitespace for marking keyword arguments to functions in Emacs Lisp and Common Lisp, so it does not add completely alien concepts.
</p>

<p>
The inline function call via inline " : " is a limited generalization of using the colon to mark an indentation level: If we add a syntax-element, we should use it as widely as possible to justify adding syntax overhead.
</p>

<p>
But if you need to use <code>:</code> as variable or function name, you can still do so by escaping it with a backslash (<code>\:</code>), so this does not forbid using the character.
</p>

<p>
For simple cases, the colon could be replaced by clever whitespace parsing, but there are complex cases which make this impossible. The minimal example is a theoretical doublelet which does not require a body:<sup><a id="fnr.6" name="fnr.6" class="footref" href="#fn.6">6</a></sup>
</p>

<div class="org-src-container">

<pre class="src src-scheme">(doublelet
  ((foo bar))
  ((bla foo)))
</pre>
</div>

<p>
The wisp version of this is
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #0000ff;">doublelet</span>
<span style="color: #a020f0;">  :</span>
<span style="color: #0000ff;">    foo</span> bar
<span style="color: #a020f0;">  : </span><span style="color: #b22222;">; </span><span style="color: #b22222;">&lt;- this empty backstep is the real issue</span>
<span style="color: #0000ff;">    bla</span> foo
</pre>
</div>

<p>
or shorter with inline colon (which you can use only if you don’t need further indentation-syntax inside the assignment).
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #0000ff;">doublelet</span>
<span style="color: #a020f0;">  : </span><span style="color: #0000ff;">foo</span> bar
<span style="color: #a020f0;">  : </span><span style="color: #0000ff;">bla</span> foo
</pre>
</div>

<p>
The need to be able to represent arbitrary syntax trees which can contain expressions like this is the real reason, why the colon exists. The inline and start-of-line use is only a generalization of that principle (we add a syntax-element, so we should see how far we can push it to reduce the effective cost of introducing the additional syntax).
</p>
</div>

<div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> Clever whitespace-parsing which would not work</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
There are two alternative ways to tackle this issue: deferred level-definition and fixed-width indentation.
</p>

<p>
Defining intermediate indentation-levels by later elements (deferred definition) would be a problem, because it would create code which is really hard to understand. An example is the following:
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">define</span> (<span style="color: #0000ff;">flubb</span>)
<span style="color: #0000ff;">    nubb</span>
<span style="color: #0000ff;">    hubb</span>
<span style="color: #0000ff;">    subb</span>
<span style="color: #0000ff;">   gam</span>
</pre>
</div>

<p>
would become
</p>

<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">flubb</span>)
   ((nubb))
   ((hubb))
   ((subb))
  (gam))
</pre>
</div>

<p>
while
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">define</span> (<span style="color: #0000ff;">flubb</span>)
<span style="color: #0000ff;">    nubb</span>
<span style="color: #0000ff;">    hubb</span>
<span style="color: #0000ff;">    subb</span>
</pre>
</div>

<p>
would become
</p>

<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">flubb</span>)
   (nubb)
   (hubb)
   (subb))
</pre>
</div>

<p>
Knowledge of later parts of the code would be necessary to understand the parts a programmer is working on at the moment. This would call for subtle errors which would be hard to track down, because the effect of a change in code would not be localized at the point where the change is done but could propagate backwards.
</p>

<p>
Fixed indentation width (alternative option to inferring it from later lines) would make it really hard to write readable code. Stuff like this would not be possible:
</p>

<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">when</span>
<span style="color: #0000ff;">    equal?</span> wrong
<span style="color: #0000ff;">           isright?</span> stuff
<span style="color: #0000ff;">    fixstuff&#65279;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> _ (the underscore)</h3>
<div class="outline-text-3" id="text-5-3">
<p>
In Python the whitespace hostile html already presents problems with sharing code - for example in email list archives and forums. But Python-programmers can mostly infer the indentation by looking at the previous line: If that ends with a colon, the next line must be more indented (there is nothing to clearly mark reduced indentation, though). In wisp we do not have this support, so we need a way to survive in the hostile environment of todays web.
</p>

<p>
The underscore is commonly used to denote a space in URLs, where spaces are inconvenient, but it is rarely used in Scheme (where the dash ("-") is mostly used instead), so it seems like a a natural choice.
</p>

<p>
You can still use underscores anywhere but at the beginning of the line, and even at the beginning of the line you simply need to escape it by prefixing the first underscore with a backslash ("\____").
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Implementation</h2>
<div class="outline-text-2" id="text-6">
<p>
This reference implementation realizes a specialized parser for Scheme. It uses GNU Guile and can also be used at the REPL. 
</p>

<p>
The wisp code also contains a general wisp-preprocessor which can be used for any lisp-like language and can used as an external program which gets called on reading. It does not actually have to understand the code itself. This is not part of this SRFI, though.
</p>

<p>
To allow for easy re-implementation, the chapter after the implementation itself contains a test-suite with commonly used wisp constructs and parenthesized counterparts.
</p>

<p>
The wisp preprocessor implementation can be found at <a href="http://draketo.de/proj/wisp">http://draketo.de/proj/wisp</a>. Both implementations are explicitly licensed to allow inclusion in an SRFI.
</p>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> The generic wisp processor (code)</h3>
<div class="outline-text-3" id="text-6-1">
<p>
TODO: Include the code from <a href="http://draketo.de/proj/wisp">http://draketo.de/proj/wisp</a>
</p>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Test Suite</h3>
<div class="outline-text-3" id="text-6-2">
<p>
The wisp test-suite consists of a large number of wisp-snippets and the corresponding scheme-code. 
</p>

<p>
A wisp-implementation may call itself compliant with the wisp test-suite if the code tree parsed from the wisp file is the same as a code tree parsed from the equivalent Scheme file.
</p>

<p>
A wisp-implementation may call itself a compliant wisp pre-processor if it successfully converts each wisp-snippet into the corresponging scheme-snippet. Blank lines at the end of the file and non-functional white-space in the produced scheme-file do not matter for this purpose.
</p>

<p>
This test-suite is also available in the <a href="http://draketo.de/proj/wisp">wisp repository</a> along with a script-runner (runtests.sh) which tests the reference wisp-implementation with GNU Guile against this testsuite.<sup><a id="fnr.7" name="fnr.7" class="footref" href="#fn.7">7</a></sup>
</p>
</div>

<div id="outline-container-sec-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> tests/syntax-underscore.w</h4>
<div class="outline-text-4" id="text-6-2-1">
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">a</span> b c
<span style="color: #0000ff;">_ d</span> e
<span style="color: #0000ff;">___ f</span>
<span style="color: #0000ff;">___</span> g h
<span style="color: #0000ff;">__</span><span style="color: #a020f0;">  . </span>i

<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">_</span>
<span style="color: #0000ff;">_  display</span> <span style="color: #8b2252;">"hello\n"</span>

<span style="color: #0000ff;">\_</span>
</pre>
</div>
</div>
</div>
