docs/srfi.org
*** tests/syntax-underscore.scm
#+begin_src scheme
(define (a b c)
  (d e
    (f)
    (g h)
    i))

(define (_)
   (display "hello\n"))

(_)


#+end_src 
*** tests/syntax-strings-parens.w
#+begin_src wisp
; Test linebreaks in strings and brackets

. "flubbub

flabbab"

hrug (nadda
madda gadda "shoktom
 mee"  " sep  
ka"
  hadda)
    gom

flu

sum [foo
bar] barz {1 + [* 2 2]}

mara {
li
+
lo (mabba)
}
#+end_src 
*** tests/syntax-strings-parens.scm
#+begin_src scheme
; Test linebreaks in strings and brackets

"flubbub

flabbab"

(hrug (nadda
madda gadda "shoktom
 mee"  " sep  
ka"
  hadda)
    (gom))

(flu)

(sum [foo
bar] barz {1 + [* 2 2]})

(mara {
li
+
lo (mabba)
})
#+end_src 
*** tests/syntax-indent.w
#+begin_src wisp
define 
  hello who
  format #t "Hello ~A\n" who

define
    let
      :
        a 1
        b 2
        c 3
      format #t "a: ~A, b: ~A, c: ~A"
                   + a 2
                   .        b      c

#+end_src 
*** tests/syntax-indent.scm
#+begin_src scheme
(define 
  (hello who)
  (format #t "Hello ~A\n" who))

(define
    (let
      (
        (a 1)
        (b 2)
        (c 3))
      (format #t "a: ~A, b: ~A, c: ~A"
                   (+ a 2)
                          b      c)))



#+end_src 
*** tests/syntax-empty.w
#+begin_src wisp
#+end_src 
*** tests/syntax-empty.scm
#+begin_src scheme
#+end_src 
*** tests/syntax-dot.w
#+begin_src wisp
define : foo
  . "bar"

define : bar
  ' 1
    . . 2 ; pair

display : foo
newline
display : bar
newline
#+end_src 
*** tests/syntax-dot.scm
#+begin_src scheme
(define (foo)
  "bar")

(define (bar)
  '(1
    . 2 )); pair

(display (foo))
(newline)
(display (bar))
(newline)


#+end_src 
*** tests/syntax-colon.w
#+begin_src wisp
let
  :
    a 1
    b 2
  let
    :
      :
        . c 3
    format #t "a: ~A, b: ~A, c: ~A"
              .    a      b      c

: a

define : hello
  display "hello\n"

let
  : a 1
    b 2
  format #t "a: ~A, b: ~A"
            .    a      b

let : : a ' :

let 
  :    ; foo
    a
      '

:
  a

define : \:
  hello

\:
#+end_src 
*** tests/syntax-colon.scm
#+begin_src scheme
(let
  (
    (a 1)
    (b 2))
  (let
    (
      (
        c 3))
    (format #t "a: ~A, b: ~A, c: ~A"
                 a      b      c)))

((a))

(define (hello)
  (display "hello\n"))

(let
  ((a 1)
    (b 2))
  (format #t "a: ~A, b: ~A"
               a      b))

(let ((a '())))

(let 
  (    ; foo
    (a
      '())))

(
  (a))

(define (:)
  (hello))

(:)


#+end_src 
*** tests/sublist.w
#+begin_src wisp
; sublists allow to start single line function calls with a colon ( : ).
;
define : a b c
  let : : e . f
        . g
#+end_src 
*** tests/sublist.scm
#+begin_src scheme
; sublists allow to start single line function calls with a colon ( : ).

(define (a b c)
  (let ((e . f))
        g))


#+end_src 
*** tests/shebang.w
#+begin_src wisp
#!/usr/bin/wisp.py # !#
; This tests shebang lines
#+end_src 
*** tests/shebang.scm
#+begin_src scheme
#!/usr/bin/wisp.py # !#
; This tests shebang lines


#+end_src 
