docs/srfi.html
<div id="outline-container-sec-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> tests/syntax-underscore.scm</h4>
<div class="outline-text-4" id="text-6-2-2">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">a</span> b c)
  (d e
    (f)
    (g h)
    i))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">_</span>)
   (display <span style="color: #8b2252;">"hello\n"</span>))

(_)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-3" class="outline-4">
<h4 id="sec-6-2-3"><span class="section-number-4">6.2.3</span> tests/syntax-strings-parens.w</h4>
<div class="outline-text-4" id="text-6-2-3">
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #b22222;">; </span><span style="color: #b22222;">Test linebreaks in strings and brackets</span>

<span style="color: #a020f0;">. </span><span style="color: #8b2252;">"flubbub</span>

<span style="color: #8b2252;">flabbab"</span>

hrug (<span style="color: #0000ff;">nadda</span>
<span style="color: #0000ff;">madda</span> gadda <span style="color: #8b2252;">"shoktom</span>
<span style="color: #8b2252;"> mee"</span>  <span style="color: #8b2252;">" sep  </span>
<span style="color: #8b2252;">ka"</span>
<span style="color: #0000ff;">  hadda)</span>
<span style="color: #0000ff;">    gom</span>

<span style="color: #0000ff;">flu</span>

<span style="color: #0000ff;">sum</span> [foo
<span style="color: #0000ff;">bar]</span> barz {1 + [* <span style="color: #008b8b;">2</span> <span style="color: #008b8b;">2</span>]}

<span style="color: #0000ff;">mara</span> {
<span style="color: #0000ff;">li</span>
<span style="color: #0000ff;">+</span>
<span style="color: #0000ff;">lo</span> - (<span style="color: #0000ff;">mabba</span>)
<span style="color: #0000ff;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-4" class="outline-4">
<h4 id="sec-6-2-4"><span class="section-number-4">6.2.4</span> tests/syntax-strings-parens.scm</h4>
<div class="outline-text-4" id="text-6-2-4">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #b22222;">; </span><span style="color: #b22222;">Test linebreaks in strings and brackets</span>

<span style="color: #8b2252;">"flubbub</span>

<span style="color: #8b2252;">flabbab"</span>

(hrug (nadda
madda gadda <span style="color: #8b2252;">"shoktom</span>
<span style="color: #8b2252;"> mee"</span>  <span style="color: #8b2252;">" sep  </span>
<span style="color: #8b2252;">ka"</span>
  hadda)
    (gom))

(flu)

(sum [foo
bar] barz {1 + [* 2 2]})

(mara {
li
+
lo - (mabba)
})
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-5" class="outline-4">
<h4 id="sec-6-2-5"><span class="section-number-4">6.2.5</span> tests/syntax-indent.w</h4>
<div class="outline-text-4" id="text-6-2-5">
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">define</span> 
<span style="color: #0000ff;">  hello</span> who
<span style="color: #0000ff;">  format</span> <span style="color: #008b8b;">#t</span> <span style="color: #8b2252;">"Hello ~A\n"</span> who

<span style="color: #483d8b;">define</span>
    <span style="color: #483d8b;">let</span>
<span style="color: #a020f0;">      :</span>
<span style="color: #0000ff;">        a</span> <span style="color: #008b8b;">1</span>
<span style="color: #0000ff;">        b</span> <span style="color: #008b8b;">2</span>
<span style="color: #0000ff;">        c</span> <span style="color: #008b8b;">3</span>
<span style="color: #0000ff;">      format</span> <span style="color: #008b8b;">#t</span> <span style="color: #8b2252;">"a: ~A, b: ~A, c: ~A"</span>
<span style="color: #0000ff;">                   +</span> a <span style="color: #008b8b;">2</span>
<span style="color: #a020f0;">                   . </span>       b      c
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-6" class="outline-4">
<h4 id="sec-6-2-6"><span class="section-number-4">6.2.6</span> tests/syntax-indent.scm</h4>
<div class="outline-text-4" id="text-6-2-6">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> 
  (hello who)
  (format #t <span style="color: #8b2252;">"Hello ~A\n"</span> who))

(<span style="color: #a020f0;">define</span>
    (<span style="color: #a020f0;">let</span>
      (
        (a 1)
        (b 2)
        (c 3))
      (format #t <span style="color: #8b2252;">"a: ~A, b: ~A, c: ~A"</span>
                   (+ a 2)
                          b      c)))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-7" class="outline-4">
<h4 id="sec-6-2-7"><span class="section-number-4">6.2.7</span> tests/syntax-empty.w</h4>
<div class="outline-text-4" id="text-6-2-7">
<div class="org-src-container">

<pre class="src src-wisp"></pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-8" class="outline-4">
<h4 id="sec-6-2-8"><span class="section-number-4">6.2.8</span> tests/syntax-empty.scm</h4>
<div class="outline-text-4" id="text-6-2-8">
<div class="org-src-container">

<pre class="src src-scheme"></pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-9" class="outline-4">
<h4 id="sec-6-2-9"><span class="section-number-4">6.2.9</span> tests/syntax-dot.w</h4>
<div class="outline-text-4" id="text-6-2-9">
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">foo</span>
<span style="color: #a020f0;">  . </span><span style="color: #8b2252;">"bar"</span>

<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">bar</span>
<span style="color: #0000ff;">  '</span> <span style="color: #008b8b;">1</span>
<span style="color: #a020f0;">    . . </span><span style="color: #008b8b;">2</span> <span style="color: #b22222;">; </span><span style="color: #b22222;">pair</span>

<span style="color: #0000ff;">display</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">foo</span>
<span style="color: #0000ff;">newline</span>
<span style="color: #0000ff;">display</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">bar</span>
<span style="color: #0000ff;">newline</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-10" class="outline-4">
<h4 id="sec-6-2-10"><span class="section-number-4">6.2.10</span> tests/syntax-dot.scm</h4>
<div class="outline-text-4" id="text-6-2-10">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">foo</span>)
  <span style="color: #8b2252;">"bar"</span>)

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">bar</span>)
  '(1
    . 2 ))<span style="color: #b22222;">; </span><span style="color: #b22222;">pair</span>

(display (foo))
(newline)
(display (bar))
(newline)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-11" class="outline-4">
<h4 id="sec-6-2-11"><span class="section-number-4">6.2.11</span> tests/syntax-colon.w</h4>
<div class="outline-text-4" id="text-6-2-11">
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">let</span>
<span style="color: #a020f0;">  :</span>
<span style="color: #0000ff;">    a</span> <span style="color: #008b8b;">1</span>
<span style="color: #0000ff;">    b</span> <span style="color: #008b8b;">2</span>
  <span style="color: #483d8b;">let</span>
<span style="color: #a020f0;">    :</span>
<span style="color: #a020f0;">      :</span>
<span style="color: #a020f0;">        . </span>c <span style="color: #008b8b;">3</span>
<span style="color: #0000ff;">    format</span> <span style="color: #008b8b;">#t</span> <span style="color: #8b2252;">"a: ~A, b: ~A, c: ~A"</span>
<span style="color: #a020f0;">              . </span>   a      b      c

<span style="color: #a020f0;">: </span>a

<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">hello</span>
<span style="color: #0000ff;">  display</span> <span style="color: #8b2252;">"hello\n"</span>

<span style="color: #483d8b;">let</span>
<span style="color: #a020f0;">  : </span><span style="color: #0000ff;">a</span> <span style="color: #008b8b;">1</span>
<span style="color: #0000ff;">    b</span> <span style="color: #008b8b;">2</span>
<span style="color: #0000ff;">  format</span> <span style="color: #008b8b;">#t</span> <span style="color: #8b2252;">"a: ~A, b: ~A"</span>
<span style="color: #a020f0;">            . </span>   a      b

<span style="color: #483d8b;">let</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">:</span> a ' :

<span style="color: #483d8b;">let</span> 
<span style="color: #a020f0;">  : </span>   <span style="color: #b22222;">; </span><span style="color: #b22222;">foo</span>
<span style="color: #0000ff;">    a</span>
      '

<span style="color: #a020f0;">:</span>
  a

<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">\:</span>
<span style="color: #0000ff;">  hello</span>

<span style="color: #0000ff;">\:</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-12" class="outline-4">
<h4 id="sec-6-2-12"><span class="section-number-4">6.2.12</span> tests/syntax-colon.scm</h4>
<div class="outline-text-4" id="text-6-2-12">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #a020f0;">let</span>
  (
    (a 1)
    (b 2))
  (<span style="color: #a020f0;">let</span>
    (
      (
        c 3))
    (format #t <span style="color: #8b2252;">"a: ~A, b: ~A, c: ~A"</span>
                 a      b      c)))

((a))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">hello</span>)
  (display <span style="color: #8b2252;">"hello\n"</span>))

(<span style="color: #a020f0;">let</span>
  ((a 1)
    (b 2))
  (format #t <span style="color: #8b2252;">"a: ~A, b: ~A"</span>
               a      b))

(<span style="color: #a020f0;">let</span> ((a '())))

(<span style="color: #a020f0;">let</span> 
  (    <span style="color: #b22222;">; </span><span style="color: #b22222;">foo</span>
    (a
      '())))

(
  (a))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">:</span>)
  (hello))

(:)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-13" class="outline-4">
<h4 id="sec-6-2-13"><span class="section-number-4">6.2.13</span> tests/sublist.w</h4>
<div class="outline-text-4" id="text-6-2-13">
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #b22222;">; </span><span style="color: #b22222;">sublists allow to start single line function calls with a colon ( : ).</span>

<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">a</span> b c
  <span style="color: #483d8b;">let</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">:</span> e<span style="color: #a020f0;"> . </span>f
<span style="color: #a020f0;">        . </span>g
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-14" class="outline-4">
<h4 id="sec-6-2-14"><span class="section-number-4">6.2.14</span> tests/sublist.scm</h4>
<div class="outline-text-4" id="text-6-2-14">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #b22222;">; </span><span style="color: #b22222;">sublists allow to start single line function calls with a colon ( : ).</span>

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">a</span> b c)
  (<span style="color: #a020f0;">let</span> ((e . f))
        g))
</pre>
</div>
</div>
</div>
