docs/srfi.org
*** tests/readable-tests.w
#+begin_src wisp
define : fibfast n
      if : < n 2
      . n           
      fibup n 2 1 0 

define : fibup maxnum count n-1 n-2
       if : = maxnum count
         + n-1  n-2
         fibup maxnum 
               + count 1 
               + n-1 n-2 
               . n-1

define : factorial n
       if : <= n 1
         . 1
         * n 
           factorial : - n 1

define (gcd x y)
       if (= y 0)
       . x
       gcd y
         rem x y

define : add-if-all-numbers lst
       call/cc 
         lambda : exit
                let loop 
                  : 
                    lst lst 
                    sum 0
                  if : null? lst
                     . sum
                     if : not : number? : car lst
                        exit #f
                        + : car lst
                          loop : cdr lst
#+end_src 
*** tests/readable-tests.scm
#+begin_src scheme
(define (fibfast n)
      (if (< n 2))
      n           
      (fibup n 2 1 0 ))

(define (fibup maxnum count n-1 n-2)
       (if (= maxnum count)
         (+ n-1  n-2)
         (fibup maxnum 
               (+ count 1 )
               (+ n-1 n-2 )
               n-1)))

(define (factorial n)
       (if (<= n 1)
         1
         (* n 
           (factorial (- n 1)))))

(define (gcd x y)
       (if (= y 0))
       x
       (gcd y
         (rem x y)))

(define (add-if-all-numbers lst)
       (call/cc 
         (lambda (exit)
                (let loop 
                  (
                    (lst lst )
                    (sum 0))
                  (if (null? lst)
                     sum
                     (if (not (number? (car lst)))
                        (exit #f)
                        (+ (car lst)
                          (loop (cdr lst)))))))))

#+end_src 
*** tests/range.w
#+begin_src wisp
import : rnrs

define range
 case-lambda
   : n ; one-argument syntax
     range 0 n 1
   : n0 n ; two-argument syntax
     range n0 n 1
   : n0 n s ; three-argument syntax
     assert 
         and 
             for-all number? : list n0 n s
             not : zero? s
     let : : cmp : if (positive? s) >= <= 
       let loop 
           : i n0 
             acc '()
           if 
             cmp i n 
             reverse acc
             loop (+ i s) (cons i acc)
             
display : apply string-append "" : map number->string : range 5
newline
#+end_src 
*** tests/range.scm
#+begin_src scheme
(import (rnrs))

(define range
 (case-lambda
   ((n ); one-argument syntax
     (range 0 n 1))
   ((n0 n ); two-argument syntax
     (range n0 n 1))
   ((n0 n s ); three-argument syntax
     (assert 
         (and 
             (for-all number? (list n0 n s))
             (not (zero? s))))
     (let ((cmp (if (positive? s) >= <= )))
       (let loop 
           ((i n0 )
             (acc '()))
           (if 
             (cmp i n )
             (reverse acc)
             (loop (+ i s) (cons i acc))))))))
             
(display (apply string-append "" (map number->string (range 5))))
(newline)

#+end_src 
*** tests/quotecolon.w
#+begin_src wisp
#!/home/arne/wisp/wisp-multiline.sh  
; !#
define a 1 ; test whether ' : correctly gets turned into '(
; and whether brackets in commments are treated correctly.

define a ' : 1 2 3

define
  a b
  c
#+end_src 
*** tests/quotecolon.scm
#+begin_src scheme
#!/home/arne/wisp/wisp-multiline.sh  
; !#
(define a 1 ); test whether ' : correctly gets turned into '(
; and whether brackets in commments are treated correctly.

(define a '(1 2 3))

(define
  (a b)
  (c))


#+end_src 
*** tests/namedlet.w
#+begin_src wisp
#!/home/arne/wisp/wisp-multiline.sh  
; !#
define : hello who
  display who

let hello
  : who 0
  if : = who 5
    display who
    hello : + 1 who
#+end_src 
*** tests/namedlet.scm
#+begin_src scheme
#!/home/arne/wisp/wisp-multiline.sh  
; !#
(define (hello who)
  (display who))

(let hello
  ((who 0))
  (if (= who 5)
    (display who)
    (hello (+ 1 who))))


#+end_src 
*** tests/mtest.w
#+begin_src wisp
#!/home/arne/wisp/wisp-multiline.sh  !#

display 1
#+end_src 
*** tests/mtest.scm
#+begin_src scheme
#!/home/arne/wisp/wisp-multiline.sh  !#

(display 1)


#+end_src 
