docs/srfi.html
<div id="outline-container-sec-6-2-15" class="outline-4">
<h4 id="sec-6-2-15"><span class="section-number-4">6.2.15</span> tests/hashbang.w</h4>
<div class="outline-text-4" id="text-6-2-15">
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #b22222;">#!/usr/bin/wisp.py # !#</span>
<span style="color: #b22222;">; </span><span style="color: #b22222;">This tests hashbang lines</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-16" class="outline-4">
<h4 id="sec-6-2-16"><span class="section-number-4">6.2.16</span> tests/hashbang.scm</h4>
<div class="outline-text-4" id="text-6-2-16">
<div class="org-src-container">

<pre class="src src-scheme">#!/usr/bin/wisp.py # !#
<span style="color: #b22222;">; </span><span style="color: #b22222;">This tests hashbang lines</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-17" class="outline-4">
<h4 id="sec-6-2-17"><span class="section-number-4">6.2.17</span> tests/readable-tests.w</h4>
<div class="outline-text-4" id="text-6-2-17">
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">fibfast</span> n
      <span style="color: #483d8b;">if</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">&lt;</span> n <span style="color: #008b8b;">2</span>
<span style="color: #a020f0;">      . </span>n           
<span style="color: #0000ff;">      fibup</span> n <span style="color: #008b8b;">2</span> <span style="color: #008b8b;">1</span> <span style="color: #008b8b;">0</span> 

<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">fibup</span> maxnum count n-1 n-2
       <span style="color: #483d8b;">if</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">=</span> maxnum count
<span style="color: #0000ff;">         +</span> n-1  n-2
<span style="color: #0000ff;">         fibup</span> maxnum 
<span style="color: #0000ff;">               +</span> count <span style="color: #008b8b;">1</span> 
<span style="color: #0000ff;">               +</span> n-1 n-2 
<span style="color: #a020f0;">               . </span>n-1

<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">factorial</span> n
       <span style="color: #483d8b;">if</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">&lt;=</span> n <span style="color: #008b8b;">1</span>
<span style="color: #a020f0;">         . </span><span style="color: #008b8b;">1</span>
<span style="color: #0000ff;">         *</span> n 
<span style="color: #0000ff;">           factorial</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">-</span> n <span style="color: #008b8b;">1</span>

<span style="color: #483d8b;">define</span> (<span style="color: #0000ff;">gcd</span> x y)
       <span style="color: #483d8b;">if</span> (<span style="color: #0000ff;">=</span> y <span style="color: #008b8b;">0</span>)
<span style="color: #a020f0;">       . </span>x
<span style="color: #0000ff;">       gcd</span> y
<span style="color: #0000ff;">         rem</span> x y

<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">add-if-all-numbers</span> lst
<span style="color: #0000ff;">       call/cc</span> 
<span style="color: #0000ff;">         lambda</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">exit</span>
                <span style="color: #483d8b;">let</span> loop 
<span style="color: #a020f0;">                  : </span>
<span style="color: #0000ff;">                    lst</span> lst 
<span style="color: #0000ff;">                    sum</span> <span style="color: #008b8b;">0</span>
                  <span style="color: #483d8b;">if</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">null?</span> lst
<span style="color: #a020f0;">                     . </span>sum
                     <span style="color: #483d8b;">if</span><span style="color: #a020f0;"> : </span><span style="color: #483d8b;">not</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">number?</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">car</span> lst
<span style="color: #0000ff;">                        exit</span> <span style="color: #008b8b;">#f</span>
<span style="color: #0000ff;">                        +</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">car</span> lst
<span style="color: #0000ff;">                          loop</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">cdr</span> lst
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-18" class="outline-4">
<h4 id="sec-6-2-18"><span class="section-number-4">6.2.18</span> tests/readable-tests.scm</h4>
<div class="outline-text-4" id="text-6-2-18">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">fibfast</span> n)
      (<span style="color: #a020f0;">if</span> (&lt; n 2))
      n           
      (fibup n 2 1 0 ))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">fibup</span> maxnum count n-1 n-2)
       (<span style="color: #a020f0;">if</span> (= maxnum count)
         (+ n-1  n-2)
         (fibup maxnum 
               (+ count 1 )
               (+ n-1 n-2 )
               n-1)))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">factorial</span> n)
       (<span style="color: #a020f0;">if</span> (&lt;= n 1)
         1
         (* n 
           (factorial (- n 1)))))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">gcd</span> x y)
       (<span style="color: #a020f0;">if</span> (= y 0))
       x
       (gcd y
         (rem x y)))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">add-if-all-numbers</span> lst)
       (<span style="color: #a020f0;">call/cc</span> 
         (<span style="color: #a020f0;">lambda</span> (exit)
                (<span style="color: #a020f0;">let</span> <span style="color: #0000ff;">loop</span> 
                  (
                    (lst lst )
                    (sum 0))
                  (<span style="color: #a020f0;">if</span> (null? lst)
                     sum
                     (<span style="color: #a020f0;">if</span> (not (number? (car lst)))
                        (exit #f)
                        (+ (car lst)
                          (loop (cdr lst)))))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-19" class="outline-4">
<h4 id="sec-6-2-19"><span class="section-number-4">6.2.19</span> tests/quotecolon.w</h4>
<div class="outline-text-4" id="text-6-2-19">
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #b22222;">#!/home/arne/wisp/wisp-multiline.sh  </span>
<span style="color: #b22222;">; </span><span style="color: #b22222;">!#</span>
<span style="color: #483d8b;">define</span> a <span style="color: #008b8b;">1</span> <span style="color: #b22222;">; </span><span style="color: #b22222;">test whether ' : correctly gets turned into '(</span>
<span style="color: #b22222;">; </span><span style="color: #b22222;">and whether brackets in commments are treated correctly.</span>

<span style="color: #483d8b;">define</span> a '<span style="color: #a020f0;"> : </span><span style="color: #0000ff;">1</span> <span style="color: #008b8b;">2</span> <span style="color: #008b8b;">3</span>

<span style="color: #483d8b;">define</span>
<span style="color: #0000ff;">  a</span> b
<span style="color: #0000ff;">  c</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-20" class="outline-4">
<h4 id="sec-6-2-20"><span class="section-number-4">6.2.20</span> tests/quotecolon.scm</h4>
<div class="outline-text-4" id="text-6-2-20">
<div class="org-src-container">

<pre class="src src-scheme">#!/home/arne/wisp/wisp-multiline.sh  
<span style="color: #b22222;">; </span><span style="color: #b22222;">!#</span>
(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">a</span> 1 )<span style="color: #b22222;">; </span><span style="color: #b22222;">test whether ' : correctly gets turned into '(</span>
<span style="color: #b22222;">; </span><span style="color: #b22222;">and whether brackets in commments are treated correctly.</span>

(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">a</span> '(1 2 3))

(<span style="color: #a020f0;">define</span>
  (a b)
  (c))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-21" class="outline-4">
<h4 id="sec-6-2-21"><span class="section-number-4">6.2.21</span> tests/namedlet.w</h4>
<div class="outline-text-4" id="text-6-2-21">
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #b22222;">#!/home/arne/wisp/wisp-multiline.sh  </span>
<span style="color: #b22222;">; </span><span style="color: #b22222;">!#</span>
<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">hello</span> who
<span style="color: #0000ff;">  display</span> who

<span style="color: #483d8b;">let</span> hello
<span style="color: #a020f0;">  : </span><span style="color: #0000ff;">who</span> <span style="color: #008b8b;">0</span>
  <span style="color: #483d8b;">if</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">=</span> who <span style="color: #008b8b;">5</span>
<span style="color: #0000ff;">    display</span> who
<span style="color: #0000ff;">    hello</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">+</span> <span style="color: #008b8b;">1</span> who
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-22" class="outline-4">
<h4 id="sec-6-2-22"><span class="section-number-4">6.2.22</span> tests/namedlet.scm</h4>
<div class="outline-text-4" id="text-6-2-22">
<div class="org-src-container">

<pre class="src src-scheme">#!/home/arne/wisp/wisp-multiline.sh  
<span style="color: #b22222;">; </span><span style="color: #b22222;">!#</span>
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">hello</span> who)
  (display who))

(<span style="color: #a020f0;">let</span> <span style="color: #0000ff;">hello</span>
  ((who 0))
  (<span style="color: #a020f0;">if</span> (= who 5)
    (display who)
    (hello (+ 1 who))))
</pre>
</div>
</div>
</div>
