docs/srfi.org
*** tests/flexible-parameter-list.w
#+begin_src wisp
; Test using a . as first parameter on a line by prefixing it with a second .
define
  a i
    . . b
  unless : >= i : length b
    display : number->string : length b 
    display : list-ref b i
    newline
    apply a ( + i 1 ) b
    

a 0 "123" "345" "567"
#+end_src 
*** tests/flexible-parameter-list.scm
#+begin_src scheme
; Test using a . as first parameter on a line by prefixing it with a second .
(define
  (a i
    . b)
  (unless (>= i (length b))
    (display (number->string (length b )))
    (display (list-ref b i))
    (newline)
    (apply a ( + i 1 ) b)))
    

(a 0 "123" "345" "567")


#+end_src 
*** tests/factorial.w
#+begin_src wisp
;; short version
; note: once you use one inline colon, all the following forms on that
; line will get closed at the end of the line

define : factorial n
  if : zero? n
    . 1
    * n : factorial : - n 1

display : factorial 5 


;; more vertical space, less colons
define : factorial n
  if : zero? n
    . 1
    * n 
      factorial 
        - n 1

display : factorial 5 

#+end_src 
*** tests/factorial.scm
#+begin_src scheme
;; short version
; note: once you use one inline colon, all the following forms on that
; line will get closed at the end of the line

(define (factorial n)
  (if (zero? n)
    1
    (* n (factorial (- n 1)))))

(display (factorial 5 ))


;; more vertical space, less colons
(define (factorial n)
  (if (zero? n)
    1
    (* n 
      (factorial 
        (- n 1)))))

(display (factorial 5 ))



#+end_src 
*** tests/example.w
#+begin_src wisp
define (a b c)
  let
    : 
      d "i am a string
do not break me!"
      : 
  ; comment: 0
        f
; comment : 1
        ` g ; comment " : " 2
      : 
        h (I am in brackets:
           do not : change "me")
        . i
  , 'j k

  . l

; comment

  a c

define : b :n o
  . "second defun : with a docstring!"
  message "I am here"
  . t

define : c e f
  : g
  :
    h
      i
    j
  ' :
  k
  . l
  . : m

define : _ \:
__
__ . \:

\_ b

define : d 
      let 
          : a b
            c d

a : : : c

let 
    : a b
      c

let : : a b

. a

#+end_src 
*** tests/example.scm
#+begin_src scheme
(define (a b c)
  (let
    (
      (d "i am a string
do not break me!")
      (
  ; comment: 0
        (f)
; comment : 1
        `(g )); comment " : " 2
      (
        (h (I am in brackets:
           do not : change "me"))
        i)))
  ,('j k)

  l

; comment

  (a c))

(define (b :n o)
  "second defun : with a docstring!"
  (message "I am here")
  t)

(define (c e f)
  ((g))
  (
    (h
      (i))
    (j))
  '(())
  (k)
  l
  (m))

(define (_ :)
  
   :)

(_ b)

(define (d)
      (let 
          ((a b)
            (c d))))

(a (((c))))

(let 
    ((a b)
      (c)))

(let ((a b)))

a



#+end_src 
*** tests/continuation.w
#+begin_src wisp
a b c d e
  . f g h
  . i j k

concat "I want " 
    getwish from me
    . " - " username

#+end_src 
*** tests/continuation.scm
#+begin_src scheme
(a b c d e
  f g h
  i j k)

(concat "I want " 
    (getwish from me)
    " - " username)



#+end_src 
*** tests/btest.w
#+begin_src wisp
display "b"
newline
#+end_src 
*** tests/btest.scm
#+begin_src scheme
(display "b")
(newline)
#+end_src

