docs/srfi.html
<div id="outline-container-sec-6-2-23" class="outline-4">
<h4 id="sec-6-2-23"><span class="section-number-4">6.2.23</span> tests/flexible-parameter-list.w</h4>
<div class="outline-text-4" id="text-6-2-23">
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #b22222;">; </span><span style="color: #b22222;">Test using a . as first parameter on a line by prefixing it with a second .</span>
<span style="color: #483d8b;">define</span>
<span style="color: #0000ff;">  a</span> i
<span style="color: #a020f0;">    . . </span>b
<span style="color: #0000ff;">  unless</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">&gt;=</span> i<span style="color: #a020f0;"> : </span><span style="color: #0000ff;">length</span> b
<span style="color: #0000ff;">    display</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">number-&gt;string</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">length</span> b 
<span style="color: #0000ff;">    display</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">list-ref</span> b i
<span style="color: #0000ff;">    newline</span>
<span style="color: #0000ff;">    apply</span> a ( <span style="color: #0000ff;">+</span> i <span style="color: #008b8b;">1</span> ) b


<span style="color: #0000ff;">a</span> <span style="color: #008b8b;">0</span> <span style="color: #8b2252;">"123"</span> <span style="color: #8b2252;">"345"</span> <span style="color: #8b2252;">"567"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-24" class="outline-4">
<h4 id="sec-6-2-24"><span class="section-number-4">6.2.24</span> tests/flexible-parameter-list.scm</h4>
<div class="outline-text-4" id="text-6-2-24">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #b22222;">; </span><span style="color: #b22222;">Test using a . as first parameter on a line by prefixing it with a second .</span>
(<span style="color: #a020f0;">define</span>
  (a i
    . b)
  (unless (&gt;= i (length b))
    (display (number-&gt;string (length b )))
    (display (list-ref b i))
    (newline)
    (apply a ( + i 1 ) b)))


(a 0 <span style="color: #8b2252;">"123"</span> <span style="color: #8b2252;">"345"</span> <span style="color: #8b2252;">"567"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-25" class="outline-4">
<h4 id="sec-6-2-25"><span class="section-number-4">6.2.25</span> tests/factorial.w</h4>
<div class="outline-text-4" id="text-6-2-25">
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">short version</span>
<span style="color: #b22222;">; </span><span style="color: #b22222;">note: once you use one inline colon, all the following forms on that</span>
<span style="color: #b22222;">; </span><span style="color: #b22222;">line will get closed at the end of the line</span>

<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">factorial</span> n
  <span style="color: #483d8b;">if</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">zero?</span> n
<span style="color: #a020f0;">    . </span><span style="color: #008b8b;">1</span>
<span style="color: #0000ff;">    *</span> n<span style="color: #a020f0;"> : </span><span style="color: #0000ff;">factorial</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">-</span> n <span style="color: #008b8b;">1</span>

<span style="color: #0000ff;">display</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">factorial</span> <span style="color: #008b8b;">5</span> 


<span style="color: #b22222;">;; </span><span style="color: #b22222;">more vertical space, less colons</span>
<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">factorial</span> n
  <span style="color: #483d8b;">if</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">zero?</span> n
<span style="color: #a020f0;">    . </span><span style="color: #008b8b;">1</span>
<span style="color: #0000ff;">    *</span> n 
<span style="color: #0000ff;">      factorial</span> 
<span style="color: #0000ff;">        -</span> n <span style="color: #008b8b;">1</span>

<span style="color: #0000ff;">display</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">factorial</span> <span style="color: #008b8b;">5</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-26" class="outline-4">
<h4 id="sec-6-2-26"><span class="section-number-4">6.2.26</span> tests/factorial.scm</h4>
<div class="outline-text-4" id="text-6-2-26">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #b22222;">;; </span><span style="color: #b22222;">short version</span>
<span style="color: #b22222;">; </span><span style="color: #b22222;">note: once you use one inline colon, all the following forms on that</span>
<span style="color: #b22222;">; </span><span style="color: #b22222;">line will get closed at the end of the line</span>

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">factorial</span> n)
  (<span style="color: #a020f0;">if</span> (zero? n)
    1
    (* n (factorial (- n 1)))))

(display (factorial 5 ))


<span style="color: #b22222;">;; </span><span style="color: #b22222;">more vertical space, less colons</span>
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">factorial</span> n)
  (<span style="color: #a020f0;">if</span> (zero? n)
    1
    (* n 
      (factorial 
        (- n 1)))))

(display (factorial 5 ))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-27" class="outline-4">
<h4 id="sec-6-2-27"><span class="section-number-4">6.2.27</span> tests/example.w</h4>
<div class="outline-text-4" id="text-6-2-27">
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #483d8b;">define</span> (<span style="color: #0000ff;">a</span> b c)
  <span style="color: #483d8b;">let</span>
<span style="color: #a020f0;">    : </span>
<span style="color: #0000ff;">      d</span> <span style="color: #8b2252;">"i am a string</span>
<span style="color: #8b2252;">do not break me!"</span>
<span style="color: #a020f0;">      : </span>
  <span style="color: #b22222;">; </span><span style="color: #b22222;">comment: 0</span>
        f
<span style="color: #b22222;">; </span><span style="color: #b22222;">comment : 1</span>
<span style="color: #0000ff;">        `</span> g <span style="color: #b22222;">; </span><span style="color: #b22222;">comment " : " 2</span>
<span style="color: #a020f0;">      : </span>
<span style="color: #0000ff;">        h</span> (<span style="color: #0000ff;">I</span> am in brackets:
<span style="color: #0000ff;">           do</span> <span style="color: #483d8b;">not</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">change</span> <span style="color: #8b2252;">"me"</span>)
<span style="color: #a020f0;">        . </span>i
<span style="color: #0000ff;">  ,</span><span style="color: #008b8b;"> 'j</span> k

<span style="color: #a020f0;">  . </span>l

<span style="color: #b22222;">; </span><span style="color: #b22222;">comment</span>

<span style="color: #0000ff;">  a</span> c

<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">b</span> :n o
<span style="color: #a020f0;">  . </span><span style="color: #8b2252;">"second defun : with a docstring!"</span>
<span style="color: #0000ff;">  message</span> <span style="color: #8b2252;">"I am here"</span>
<span style="color: #a020f0;">  . </span>t

<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">c</span> e f
<span style="color: #a020f0;">  : </span><span style="color: #0000ff;">g</span>
<span style="color: #a020f0;">  :</span>
<span style="color: #0000ff;">    h</span>
<span style="color: #0000ff;">      i</span>
<span style="color: #0000ff;">    j</span>
<span style="color: #0000ff;">  '</span> :
<span style="color: #0000ff;">  k</span>
<span style="color: #a020f0;">  . </span>l
<span style="color: #a020f0;">  . </span>: <span style="color: #0000ff;">m</span>

<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">_</span> \:
<span style="color: #0000ff;">__</span>
<span style="color: #0000ff;">__</span><span style="color: #a020f0;"> . </span>\:

<span style="color: #0000ff;">\_</span> b

<span style="color: #483d8b;">define</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">d</span> 
      <span style="color: #483d8b;">let</span> 
<span style="color: #a020f0;">          : </span><span style="color: #0000ff;">a</span> b
<span style="color: #0000ff;">            c</span> d

<span style="color: #0000ff;">a</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">:</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">c</span>

<span style="color: #483d8b;">let</span> 
<span style="color: #a020f0;">    : </span><span style="color: #0000ff;">a</span> b
      c

<span style="color: #483d8b;">let</span><span style="color: #a020f0;"> : </span><span style="color: #0000ff;">:</span> a b

<span style="color: #a020f0;">. </span>a
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-28" class="outline-4">
<h4 id="sec-6-2-28"><span class="section-number-4">6.2.28</span> tests/example.scm</h4>
<div class="outline-text-4" id="text-6-2-28">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">a</span> b c)
  (<span style="color: #a020f0;">let</span>
    (
      (d <span style="color: #8b2252;">"i am a string</span>
<span style="color: #8b2252;">do not break me!"</span>)
      (
  <span style="color: #b22222;">; </span><span style="color: #b22222;">comment: 0</span>
        (f)
<span style="color: #b22222;">; </span><span style="color: #b22222;">comment : 1</span>
        `(g ))<span style="color: #b22222;">; </span><span style="color: #b22222;">comment " : " 2</span>
      (
        (h (I am in brackets:
           do not : change <span style="color: #8b2252;">"me"</span>))
        i)))
  ,('j k)

  l

<span style="color: #b22222;">; </span><span style="color: #b22222;">comment</span>

  (a c))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">b</span> <span style="color: #483d8b;">:n</span> o)
  <span style="color: #8b2252;">"second defun : with a docstring!"</span>
  (message <span style="color: #8b2252;">"I am here"</span>)
  t)

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">c</span> e f)
  ((g))
  (
    (h
      (i))
    (j))
  '(())
  (k)
  l
  (m))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">_</span> :)

   :)

(_ b)

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">d</span>)
      (<span style="color: #a020f0;">let</span> 
          ((a b)
            (c d))))

(a (((c))))

(<span style="color: #a020f0;">let</span> 
    ((a b)
      (c)))

(<span style="color: #a020f0;">let</span> ((a b)))

a
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-29" class="outline-4">
<h4 id="sec-6-2-29"><span class="section-number-4">6.2.29</span> tests/continuation.w</h4>
<div class="outline-text-4" id="text-6-2-29">
<div class="org-src-container">

<pre class="src src-wisp"><span style="color: #0000ff;">a</span> b c d e
<span style="color: #a020f0;">  . </span>f g h
<span style="color: #a020f0;">  . </span>i j k

<span style="color: #0000ff;">concat</span> <span style="color: #8b2252;">"I want "</span> 
<span style="color: #0000ff;">    getwish</span> from me
<span style="color: #a020f0;">    . </span><span style="color: #8b2252;">" - "</span> username
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2-30" class="outline-4">
<h4 id="sec-6-2-30"><span class="section-number-4">6.2.30</span> tests/continuation.scm</h4>
<div class="outline-text-4" id="text-6-2-30">
<div class="org-src-container">

<pre class="src src-scheme">(a b c d e
  f g h
  i j k)

(concat <span style="color: #8b2252;">"I want "</span> 
    (getwish from me)
    <span style="color: #8b2252;">" - "</span> username)
</pre>
</div>
</div>
</div>
</div>
</div>
